LEXICON_RU: dict[str, str] = {"/start": "Добро пожаловать в бота, посвящённого Константину Дмитриевичу Ушинскому. "
                              "Здесь вы можете найти много интересной информации про этого великого человека. "
                              "Бот посвящён году педагога и наставника. Если вам нужна помощь, обратитесь к команде /help.",

                              "/help": "Навигация по боту происходит за счет нажатия кнопок внизу экрана. "
                              "Если вы по какой-то причине их не видите, нажмите кнопку с правой стороны текстового поля или введите /start.",


                              "back_to_menu": "Возвращаемся в главное меню...",
                              "back_to_menu_btn": "↩ Вернуться назад ↩",
                              "activity_btn": "✏ Деятельность ✏",
                              "memory_btn": "🎞 Память о К. Д. Ушинском 🎞",
                              "biography_btn": "📖 Биография 📖",
                              "credits_btn": "❓ Общие сведения о боте ❓",

                              "biography": "Переходим в раздел про биографию...",
                              "childhood_btn": "👶 Детство и образование 📚",
                              "years_of_working_btn": "✒ Годы работы ✒",
                              "traveling_btn": "🚘 Путешествие за границу 🚘",


                              "activity": "Переходим в раздел деятельность...",
                              "ideas_btn": "💡 Идеи 💡",
                              "works_btn": "📜 Труды 📜",
                              "quotes_btn": "📎 Цитаты 📎",
                              "books_btn": "📘 Книги 📘",

                              "ideas": "<b>Основа обучения человека</b>\n"
                              "• Главный принцип — демократизация народного образования и воспитания: убрать разделение на «благородных» и «неблагородных».\n"
                              "• Теория педагогики должна разрабатываться с учетом философских, психологических, анатомических и физиологических знаний о человеке.\n"
                              "• Не основываться исключительно на собственном опыте.\n"
                              "• Теория должна быть подтверждена практикой.\n"
                              "<b>Воспитание и преподавание</b>\n"
                              "• Принимать во внимание особенности каждого народа — традиции, территорию проживания и др.\n"
                              "• Изучать родной язык и историю, чтобы привить чувство национальной гордости и уважение к другим народам.\n"
                              "• Воспитание — это сознательный, серьезный процесс, «святое дело».\n"
                              "• Направлять воспитание на гармоничное развитие личности.\n"
                              "• Воспитание нравственности первостепенно, даже важнее получения знаний. Оно приводит к дисциплинированности, гуманности, честности и трудолюбию, развивает чувство собственного достоинства и скромность.\n"
                              "• любовь и терпение необходимы, но одних их мало. Чтобы воспитать детей правильно, нужно еще разбираться в детской природе.\n"
                              "<b>Средства воспитания</b>\n"
                              "Как действовать:\n"
                              "1) обучать\n"
                              "2) подавать личный пример\n"
                              "3) убеждать\n"
                              "4) придерживаться педагогического такта\n"
                              "5) предупреждать\n"
                              "6) поощрять\n"
                              "7) взыскивать",

                              "works": "<b>Основные работы К. Д. Ушинского</b>\n"
                              "1) Статья «О пользе педагогической литературы» (1857);\n"
                              "2) Статья «О народности в общественном о воспитании» (1857);\n"
                              "3) Статья «О средствах распространения образования посредством грамотности» (1858);\n"
                              "4) Статья «Труд в его психическом и воспитательном значении» (1860);\n"
                              "5) «Детский мир и Хрестоматия». (1861);\n"
                              "6) Статья «Педагогические сочинения Н. И. Пирогова» (1862);\n"
                              "7) «Родное слово» для 1-го и 2-го года обучения (1864);\n"
                              "8) Статья «О первоначальном преподавании русского языка» (1864);\n"
                              "9) «О необходимости сделать русские школы русскими» (1867);\n"
                              "10) «Человек как предмет воспитания. Опыт педагогической антропологии» | том (1868), |! том (1869);\n"
                              "11) «Общий взгляд на возникновение наших народных школ» (1870);\n"
                              "12) «Родное слово» для 3-го года обучения с «Руководством» к нему (1870).\n",

                              "quotes": "<b>Цитаты</b>\n"
                              "• «Конечно, образование ума и обогащение его познаниями много принесёт пользы, но, увы, я никак не полагаю, чтобы ботанические и зоологические познания или даже ближайшее знакомство с глубокомысленными творениями Фохта и Молешотта могли сделать гоголевского городничего честным чиновником, и совершенно убеждён, что, будь Павел Иванович Чичиков посвящён во все тайны органической химии или политической экономии, он останется тем же, весьма вредным для общества пронырой. Переменится несколько его внешность, перестанет он подкатываться к людям с ловкостью почти военного человека, примет другие манеры, другой тон, замаскируется ещё больше, так что проведёт кого-нибудь и поумнее генерала Бедрищева, но останется всё тем же вредным членом общества, даже сделается ещё вреднее, ещё неуловимее».\n"
                              "• «Лучше не говорить ребёнку той или другой высокой истины, которой не выносит окружающая его жизнь, чем приучать его видеть в этой истине фразу, годную только для урока».\n"
                              "• «…ни политика, ни медицина, ни педагогика не могут быть названы науками в … строгом смысле, а только искусствами… Наука только изучает существующее или существовавшее, а искусство стремится творить то, чего еще нет…».\n"
                              "• «Педагогика не наука, а искусство — самое обширное, сложное, самое высокое и самое необходимое из всех искусств. Искусство воспитания опирается на науку. Как искусство сложное и обширное, оно опирается на множество обширных и сложных наук; как искусство оно кроме знаний требует способности и наклонности, и как искусство же оно стремится к идеалу, вечно достигаемому и никогда вполне недостижимому: к идеалу совершенного человека».\n",

                              "books": "<b>Книги</b>\n"
                              "• «Золотое яичко»\n"
                              "• «Слепая лошадь»\n"
                              "• «Четыре желания»\n"
                              "• «Как рубашка в поле выросла»\n"
                              "• «Бишка»\n"
                              "• «Два плуга»\n"
                              "• «Проказы старухи-зимы»\n"
                              "• «Ветер и Солнце»\n"
                              "• «Лиса и козёл»\n"
                              "• «Кот-воркот»\n"
                              "• «Рассказы о детях»\n"
                              "• «Петушок с семьёй»\n"
                              "• «Два козлика»\n"
                              "• «Дети в роще»\n"
                              "• «Умей обождать»\n"
                              "• «Жалобы зайки»\n"
                              "• «Петух да собака»\n"
                              "И многие другие...",


                              "memory": "Переходим в раздел памяти...",
                              "instituts_btn": "🏫 Учебные заведения 🏫",
                              "streets_btn": "🏙 Улицы 🏙",
                              "monuments_btn": "🎁 Прочее 🎁",

                              "institutes": "<b>В России</b>\n"
                              "• Ярославский государственный педагогический университет им. К. Д. Ушинского (ЯГПУ);\n"
                              "• Институт среднего профессионального образования им. К. Д. Ушинского в Москве;\n"
                              "• Гатчинский педагогический колледж им. К. Д. Ушинского (в Гатчине;)\n"
                              "• Педагогическое училище (колледж) в Тамбове;\n"
                              "• Гимназия в Гатчине;\n"
                              "• Школа № 6 в городе Тула;\n"
                              "• Новгородский детский дом-интернат в посёлке Шимск;\n"
                              "• Муниципальное общеобразовательное учреждение «Леснополянская начальная школа имени К.Д.Ушинского» Ярославского муниципального района, пос. Лесная Поляна Ярославской области;\n"
                              "<b>За рубежом</b>\n"
                              "• Южноукраинский национальный педагогический университет им. К. Д. Ушинского в Одессе;\n"
                              "• Черниговский областной институт последипломного образования им. К. Д. Ушинского;\n"
                              "• Специализированная школа № 187 им. К. Ушинского (Киев);\n"
                              "• средняя школа им. К. Д. Ушинского в селе Райымбек Карасайского района Алматинской области (Казахстан);\n"
                              "• Школа № 210 в городе Ташкенте;",

                              "streets": "<b>Улицы</b>\n"
                              "• Улица, на которой он жил (бывшая Стрелецкая) в Ярославле;\n"
                              "• Улица в Липецке;\n"
                              "• Улица в Санкт-Петербурге, название утверждено в 1970 году;\n"
                              "• Улицы в Киеве, в г. Миллерово, в Новокузнецке;\n"
                              "• Улица и переулок в Харькове;\n"
                              "• Улица в Симферополе;\n"
                              "• Улицы в Перми, Воронеже, Никополе, Батайске, Туле, Иркутске, Уфе, Котласе, Сочи;",

                              "monuments": "<b>Награды</b>\n"
                              "• Премия К. Д. Ушинского (существовала в СССР);\n"
                              "• Медаль К. Д. Ушинского (утверждена приказом Министра образования и науки Российской Федерации «О знаках отличия в сфере образования и науки» № 84 от 6 октября 2004 г.);\n"
                              "<b>Памятники и памятные доски</b>\n"
                              "• Санкт-Петербург, Набережная Мойки, д. 48 — Российский государственный педагогический университет имени А. И. Герцена. Памятник К. Д. Ушинскому работы скульптора В. В. Лишева был открыт во дворе института 30 июня 1961 года (изображён на фото);\n"
                              "• Москва, Моховая улица, д. 9 — Московский государственный университет имени М. В. Ломоносова, факультет журналистики (бывший Аудиторный корпус), памятная доска (открыта 2 марта 1974 к 150-летию педагога[15]);\n"
                              "<b>Марки</b>\n"
                              "• Марка «Почты России» к 150-летию Константина Ушинского (1974);\n"
                              "• Марка к 200-летию со дня рождения Константина Ушинского (2023);",


                              "childhood": "<b>Детство</b>\n"
                              "⠀⠀Город рождения — Тула. Отец — офицер в отставке, мелкопоместный дворянин. До 12 лет воспитывался дома. "
                              "Большой вклад в его начальное образование внесла мать.\n⠀⠀Эти первые 11 лет были счастливыми. Семья была весьма обеспеченная. "
                              "Жили в красивейшей местности с древней историей. Мать воспитывала сына с любовью и терпением, привила ему любовь к чтению.\n"
                              "\n<b>Образование</b>\n"
                              "⠀⠀В 12 лет лишился матери, но благодаря ее подготовке поступил в Новгород-Северскую гимназию сразу в третий класс. "
                              "Ушинский очень уважал директора этого учреждения за любовь к науке. Впоследствии он отмечал, "
                              "что полученное им в гимназии небольшого уездного городка образование было не только не хуже, но даже во многом лучше того, "
                              "что давали более крупные и уважаемые в то время учреждения.\n"
                              "⠀⠀В 1840 году поступил в Московский университет, учился на юриста. Окончил в 1844 году блестяще в статусе кандидата юридических наук.",

                              "years_of_working": ["<b>Годы работы</b>\n⠀⠀В 1846 году он был назначен исполняющим обязанности профессора камеральных наук ярославского Демидовского лицея по кафедре " # Первая страница
                              "энциклопедии законоведения, государственного права и науки финансов. С марта по май 1848 года он редактировал неофициальную часть газеты "
                              "«Ярославские губернские ведомости». Из-за обвинений в неблагонадёжности в сентябре 1849 года Ушинский оставил лицей, подав прошение об увольнении в "
                              "Петербург или Москву для совещания «с тамошними медиками о болезни». \n⠀⠀Почётный попечитель лицея Демидов писал о нём: «Ушинский имеет большое влияние "
                              "на студентов; он мог бы быть полезным в лицее, но нужно иметь за ним постоянное наблюдение со справедливой строгостью в отношении к службе». "
                              "Некоторое время он зарабатывал себе на жизнь переводами статей из иностранных журналов, рецензиями и обзорами в журналах.\n<i>1 страница</i>",

                              "⠀⠀В январе 1854 года, благодаря помощи бывшего коллеги по Демидовскому лицею, Ушинскому удалось перейти на работу преподавателя русской словесности в Гатчинском сиротском институте. " # Вторая Страница
                              "Задачей Гатчинского сиротского института было воспитание людей, верных «царю и отечеству», а применяемые для этого методы славились своей строгостью. "
                              "Ушинский так характеризовал позже институтские порядки: «Канцелярия и экономия наверху, администрация в середине, учение под ногами, а воспитание — за дверьми здания». "
                              "Уже в 1855 году он стал инспектором классов Гатчинского сиротского института. В стенах этого учебного заведения К. Д. Ушинский обнаружил архив одного из прежних инспекторов "
                              "Гатчинского сиротского института — Е. О. Гугеля, в котором он нашёл, как писал позже сам Ушинский, «полное собрание педагогических книг».\n⠀⠀Найденные книги оказали огромное "
                              "влияние на Ушинского. Впоследствии, под влиянием идей, полученных от прочтения этих книг, он написал одну из лучших своих статей по педагогике «О пользе педагогической литературы». "
                              "После огромного общественного успеха этой публикации, Ушинский стал постоянным автором «Журнала для Воспитания», где он помещал статьи, в которых развивал свои взгляды на систему "
                              "воспитания и образования в России. Также он сотрудничал в журналах «Современник» (1852—1854) и «Библиотека для чтения» (1854—1855).\n<i>2 страница</i>",

                              "⠀⠀В 1859 году Ушинского пригласили на должность инспектора классов Смольного института благородных девиц, где ему удалось провести значительные прогрессивные изменения. " # Третья страница
                              "Так, исходя из своего главного принципа демократизации народного образования и народности воспитания, ему удалось убрать существовавшее до этого разделения состава учащихся на "
                              "«благородных» и «неблагородных» (то есть из мещанского сословия), он ввёл практику преподавания учебных предметов на русском языке и открыл специальный педагогический класс, "
                              "в котором осуществлялась подготовка учащихся для работы в качестве воспитательниц. К. Д. Ушинский ввёл в практику педагогической работы совещания и конференции педагогов, "
                              "а воспитанницы получили право проводить каникулы и праздники у родителей.\n⠀⠀Одновременно с преподавательской работой Ушинский с 1860 года стал редактировать «Журнал Министерства "
                              "народного просвещения», который благодаря ему превратился в педагогический журнал, весьма отзывчиво относившийся к новым течениям в области народного образования. "
                              "После конфликта с начальницей института М. П. Леонтьевой, которая обвинила Ушинского в вольнодумстве, непочтительном отношении к начальству, атеизме и других проступках подобного рода, "
                              "его под благовидным предлогом в 1862 году удалили из института — он был направлен на пять лет за границу для лечения и изучения школьного дела. (Подробнее в пункте про путешествие)\n<i>3 страница</i>",

                              "⠀⠀В середине 1860-х годов Ушинский с семьёй вернулся в Россию. Свой последний главный научный труд, названный Ушинским «Человек как предмет воспитания, "  # Четвёртая страница
                              "опыт педагогической антропологии», он начал печатать в 1867 году. В последние годы жизни выступал как видный общественный деятель. Он писал статьи о воскресных школах, "
                              "о школах для детей ремесленников, а также принял участие в учительском съезде в Крыму. Приехав в 1870 году в Симферополь, Ушинский побывал в нескольких учебных "
                              "заведениях, в том числе женском училище; охотно встречался и с учителями, и с учащимися. При Симферопольской казённой мужской гимназии был образцовый класс по "
                              "способу наглядного обучения. Будучи одним из основателей этого способа, К. Д. Ушинский заинтересовался работой класса, присутствовал на уроках, которые проводил "
                              "И. П. Деркачев.\n⠀⠀Летом 1870 года Ушинский лечился кумысом в Альме возле Бахчисарая. Когда ог возвращался из крыма, в результате трагического случая на охоте погиб "
                              "его старший сын Павел. После этого К. Д. Ушинский решает переехать жить с семьёй в Киев, для чего он купил в Киеве по ул. Тарасовской дом, а сам с "
                              "сыновьями Константином и Владимиром поехал лечиться в Крым. По дороге в Крым он простудился и остановился для лечения в Одессе, где и "
                              "скончался 22 декабря 1870 (3 января 1871) года. Похоронен в Киеве на кладбище Выдубицкого монастыря.\n<i>4 страница</i>"],

                              "traveling": "<b>Путешествие за границу</b>\n"
                              "⠀⠀За границей в 1864 году он написал и издал учебную книгу «Родное слово», а также книгу «Детский мир». По сути это были первые массовые и общедоступные российские учебники "
                              "для начального обучения детей. Более того, Ушинский написал и издал особое руководство для родителей и учителей к своему «Родному слову» — «Руководство к преподаванию по "
                              "„Родному слову“ для учителей и родителей». Это руководство оказало огромное, широчайшее влияние на русскую народную школу. Свою значимость как пособие по методике преподавания "
                              "родного языка оно не потеряло и по сей день. Достаточно сказать, что до 1917 года оно выдержало 147 изданий.\n⠀⠀К. Д. Ушаковский посетил Италию, Германию, Швейцарию, Бельгию, Францию. "
                              "Все это были передовые в плане образования страны того времени. Там он побывал во всех возможных учебных заведениях, знакомился с методами преподавания, изучал новации. "
                              "Все записывал и позже издал большую статью и несколько книг и пособий для родителей и учителей, которые актуальны и сегодня.",


                              "credits": "В этом разделе указана общая информация про этого бота.",
                              "authors_btn": "👦 Автор 👦",
                              "sources_btn": "🔎 Источники информации 🔎",
                              "authors": "Автор: Михеев Егор Алексеевич, ученик 9б класса МОУ СОШ №3.",
                              "sources": "1) https://wiki.fenix.help/pedagogika/ushinskiy-konstantin-dmitriyevich\n"
                                         "2) https://ru.wikipedia.org/wiki/Ушинский,_Константин_Дмитриевич\n"
                                         "3) https://nauka.club/biografii/ushinskiy.html\n"
                                         "4) https://www.livelib.ru/author/18182/top-konstantin-ushinskij",
                              "other_answer": "Пожалуйста, общайтесь со мной с помощью кнопок навигации внизу экрана ☺"}


LEXICON_COMMANDS_RU: dict[str, str] = {
                '/start': 'Начало общения с ботом',
                '/help': 'Помощь'}